controllers/JenisPembayaranController.php

    public function actionIndex()
    {
        $searchModel = new SearchJenisPembayaranModel();
        $dataProvider = $searchModel->search($this->request->queryParams);

        $dataKelas = KelasModel::find()->orderBy(['created_at' => SORT_DESC])->all(); // ambil max 100, bisa disesuaikan
        $currentYear = date('Y');

        foreach ($dataKelas as $item) {
            $academicYear = (int) $item->tahun_masuk;
            $classNumber = $currentYear - $academicYear + 1;

            // Batas logika kelas 1 sampai 3
            if ($classNumber < 1) {
                $classNumber = 1;
            } elseif ($classNumber > 3) {
                $classNumber = 3;
            }

            $item->kelas = $classNumber;
            $item->save(false); // false = skip validasi, bisa diganti true jika validasi diperlukan
---
SELECT * FROM `kelas` ORDER BY `created_at` DESC
UPDATE `kelas` SET `kelas`='2' WHERE `id`=31

    public function actionUpdate($id)
    {
         $model = JenisPembayaranModel::findOne($id);

        if (!$model) {
            throw new NotFoundHttpException('Data tidak ditemukan.');
        }

        if ($this->request->isPost) {
            if ($model->load($this->request->post())) {
                if (!$model->validate()) {
                    Yii::$app->session->setFlash('error', 'Data tidak valid. Silakan periksa kembali.');
                    return $this->render('update', [
                        'model' => $model,
                    ]);
                }

                $kelas = $model->kelas ?? [];
                $jurusan = $model->jurusan_id ?? [];

                $model->updated_at = date('Y-m-d H:i:s');

                $model->kelas = !empty($kelas) ? json_encode($kelas) : '-';
                $model->jurusan_id = !empty($jurusan) ? json_encode($jurusan) : '-';

                if ($model->save(false)) {
---
SELECT * FROM `jenis_pembayaran` WHERE `id`='5'
UPDATE `jenis_pembayaran` SET `jurusan_id`='[\"2\",\"5\"]', `kelas`='-', `tahun_akademik`=2024, `kepada`='calon_siswa', `updated_at`='2025-07-23 02:32:42' WHERE `id`=5

    protected function findModel($id)
    {
        if (($model = JenisPembayaranModel::findOne(['id' => $id])) !== null) {
---
SELECT * FROM `jenis_pembayaran` WHERE `id`='5'