controllers/SiteController.php

SELECT * FROM `users` WHERE `username`='staf'
---
    public function actionLogin()
    {
        if (!Yii::$app->user->isGuest) {
            return $this->goHome();
        }

        $this->layout = 'main-login'; // Set a specific layout for the login page
        $model = new LoginForm();
    if ($model->load(Yii::$app->request->post())) {
        $user = User::findOne(['username' => $model->username]);