views/jenis-pembayaran/_form.php

SELECT * FROM `jurusan`
---

   <!-- Jurusan Select2 -->
    <div id="jurusan_wrapper">
        <?= $form->field($model, 'jurusan_id[]')->widget(Select2::class, [
            'data' => ArrayHelper::map(JurusanModel::find()->all(), 'id', 'nama'),
            'options' => [
                'placeholder' => 'Pilih Jurusan',
                'multiple' => true,
            ],
            'pluginOptions' => [
                'allowClear' => true,
            ],
        ])->label('Jurusan (Opsional)') ?>