views/jenis-pembayaran/view.php

SELECT `nama` FROM `jurusan` WHERE `id` IN ('1', '2', '3', '5', '6')
---
                            return '-';
                        }

                        $jurusanList = JurusanModel::find()
                            ->where(['id' => $decoded])
                            ->select('nama') // atau 'nama_jurusan', sesuaikan nama kolomnya
                            ->column(); // ambil hasil sebagai array nilai